CallMeC/4S_LFP_BMS/Software/RP2040/IO_Define.h
#ifndef __IO_DEFINE__H
#define __IO_DEFINE__H

//Param HW
#define PIN_0                   0
#define PIN_1                   1
#define PIN_2                   2
#define PIN_3                   3
#define CAN_RX                  4
#define CAN_TX                  5
#define OUTPUT_LED              6
#define PIN_7                   7
#define BALANCING_C1            8
#define BALANCING_C2            9
#define TIMER_DONE              10
#define STAYING_ALIVE           11
#define I2C_SDA                 12
#define I2C_SCL                 13
#define BALANCING_C3            14
#define RESET                   15
#define UART_TX_PIN             16
#define UART_RX_PIN             17
#define PIN_18                  18
#define PIN_19                  19
#define PIN_20                  20
#define PIN_21                  21
#define BALANCING_C4            22
#define PIN_23                  23
#define PIN_24                  24
#define PIN_25                  25
#define CURRENT_SHUNT           26
#define RELAY_DRIVE             27
#define PIN_28                  28
#define PIN_29                  29

#endif